#Напишите функцию, которая создаёт комбинацию двух списков таким образом:
#[1, 2, 3] (+) [11, 22, 33] -> [1, 11, 2, 22, 3, 33]

def d1(l1,l2):
    l =[]
    for i in range (max((len)(l1),(len)(l2))):
        if i<(len)(l1):
            l.append(l1[i])
        if i<(len)(l1):
            l.append(l2[i])
    return l

l1 = [1, 2, 3, 4]
l2 = [11, 22, 33, 44]
print(d1(l1,l2))